// F. Новый год: встреча друзей
/*
В Лайнландии на прямой Ox живут три друга. 
Первый живет в точке x1, второй живет в точке x2, а третий — в точке x3. 
Они собираются вместе встретить Новый Год, для чего им необходимо всем оказаться в одной точке. 
Какое минимальное суммарное расстояние им надо пройти, чтобы собраться вместе в одной точке и встретить Новый год?
Гарантируется, что правильный ответ всегда является целым числом.
Входные данные
В первой строке следует три различных целых числа x1, x2 и x3 (1 ≤ x1, x2, x3 ≤ 100) — координаты домов первого, 
второго и третьего друга.

Выходные данные
Выведите единственное целое число — минимальное суммарное расстояние, которое нужно пройти друзьям, 
чтобы собраться вместе.
*/

int a = int.Parse(Console.ReadLine());
int b = int.Parse(Console.ReadLine());
int c = int.Parse(Console.ReadLine());

int max = a;
int min = a;

if(b > max) max = b;
if(b < min) min = b;

if(c > max)	max = c;
if(c < min) min = c;
  
Console.WriteLine(max - min);
